###############################################################
#  Generated by:      Cadence Innovus 17.11-s080_1
#  OS:                Linux x86_64(Host ID cad16)
#  Generated on:      Wed May 27 00:03:49 2026
#  Design:            CHIP
###############################################################
current_design CHIP
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_clock_latency 0.5  [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_drive 1  [get_ports {clk}]
set_drive 1  [get_ports {rst_n}]
set_drive 1  [get_ports {a[7]}]
set_drive 1  [get_ports {a[6]}]
set_drive 1  [get_ports {a[5]}]
set_drive 1  [get_ports {a[4]}]
set_drive 1  [get_ports {a[3]}]
set_drive 1  [get_ports {a[2]}]
set_drive 1  [get_ports {a[1]}]
set_drive 1  [get_ports {a[0]}]
set_drive 1  [get_ports {b[7]}]
set_drive 1  [get_ports {b[6]}]
set_drive 1  [get_ports {b[5]}]
set_drive 1  [get_ports {b[4]}]
set_drive 1  [get_ports {b[3]}]
set_drive 1  [get_ports {b[2]}]
set_drive 1  [get_ports {b[1]}]
set_drive 1  [get_ports {b[0]}]
set_load -pin_load -max  10  [get_ports {valid}]
set_load -pin_load -min  10  [get_ports {valid}]
set_load -pin_load -max  10  [get_ports {Vout[11]}]
set_load -pin_load -min  10  [get_ports {Vout[11]}]
set_load -pin_load -max  10  [get_ports {Vout[10]}]
set_load -pin_load -min  10  [get_ports {Vout[10]}]
set_load -pin_load -max  10  [get_ports {Vout[9]}]
set_load -pin_load -min  10  [get_ports {Vout[9]}]
set_load -pin_load -max  10  [get_ports {Vout[8]}]
set_load -pin_load -min  10  [get_ports {Vout[8]}]
set_load -pin_load -max  10  [get_ports {Vout[7]}]
set_load -pin_load -min  10  [get_ports {Vout[7]}]
set_load -pin_load -max  10  [get_ports {Vout[6]}]
set_load -pin_load -min  10  [get_ports {Vout[6]}]
set_load -pin_load -max  10  [get_ports {Vout[5]}]
set_load -pin_load -min  10  [get_ports {Vout[5]}]
set_load -pin_load -max  10  [get_ports {Vout[4]}]
set_load -pin_load -min  10  [get_ports {Vout[4]}]
set_load -pin_load -max  10  [get_ports {Vout[3]}]
set_load -pin_load -min  10  [get_ports {Vout[3]}]
set_load -pin_load -max  10  [get_ports {Vout[2]}]
set_load -pin_load -min  10  [get_ports {Vout[2]}]
set_load -pin_load -max  10  [get_ports {Vout[1]}]
set_load -pin_load -min  10  [get_ports {Vout[1]}]
set_load -pin_load -max  10  [get_ports {Vout[0]}]
set_load -pin_load -min  10  [get_ports {Vout[0]}]
set_max_fanout 6  [get_designs {CHIP}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {b[4]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {b[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {b[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {a[7]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {a[5]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {a[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {a[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {b[7]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {b[5]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {b[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {b[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {a[6]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {a[4]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {a[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {a[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {b[6]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {Vout[6]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {Vout[4]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {Vout[2]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {Vout[10]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {Vout[0]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {valid}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {Vout[9]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {Vout[7]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {Vout[5]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {Vout[3]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {Vout[11]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {Vout[1]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {Vout[8]}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
set_clock_latency -source -early -max -rise  -0.938058 [get_ports {clk}] -clock clk 
set_clock_latency -source -early -max -fall  -0.685643 [get_ports {clk}] -clock clk 
set_clock_latency -source -late -max -rise  -0.938058 [get_ports {clk}] -clock clk 
set_clock_latency -source -late -max -fall  -0.685643 [get_ports {clk}] -clock clk 
