###################################################################

# Created by write_sdc on Wed May 20 19:53:24 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_model -name G200K -library fsa0m_a_generic_core_tt1p8v25c
set_max_fanout 6 [current_design]
set_max_area 0
set_load -pin_load 10 [get_ports valid]
set_load -pin_load 10 [get_ports {Vout[11]}]
set_load -pin_load 10 [get_ports {Vout[10]}]
set_load -pin_load 10 [get_ports {Vout[9]}]
set_load -pin_load 10 [get_ports {Vout[8]}]
set_load -pin_load 10 [get_ports {Vout[7]}]
set_load -pin_load 10 [get_ports {Vout[6]}]
set_load -pin_load 10 [get_ports {Vout[5]}]
set_load -pin_load 10 [get_ports {Vout[4]}]
set_load -pin_load 10 [get_ports {Vout[3]}]
set_load -pin_load 10 [get_ports {Vout[2]}]
set_load -pin_load 10 [get_ports {Vout[1]}]
set_load -pin_load 10 [get_ports {Vout[0]}]
create_clock [get_ports clk]  -period 3.56  -waveform {0 1.78}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  -max 1  [get_ports clk]
set_input_delay -clock clk  -max 1  [get_ports rst_n]
set_input_delay -clock clk  -max 1  [get_ports {a[7]}]
set_input_delay -clock clk  -max 1  [get_ports {a[6]}]
set_input_delay -clock clk  -max 1  [get_ports {a[5]}]
set_input_delay -clock clk  -max 1  [get_ports {a[4]}]
set_input_delay -clock clk  -max 1  [get_ports {a[3]}]
set_input_delay -clock clk  -max 1  [get_ports {a[2]}]
set_input_delay -clock clk  -max 1  [get_ports {a[1]}]
set_input_delay -clock clk  -max 1  [get_ports {a[0]}]
set_input_delay -clock clk  -max 1  [get_ports {b[7]}]
set_input_delay -clock clk  -max 1  [get_ports {b[6]}]
set_input_delay -clock clk  -max 1  [get_ports {b[5]}]
set_input_delay -clock clk  -max 1  [get_ports {b[4]}]
set_input_delay -clock clk  -max 1  [get_ports {b[3]}]
set_input_delay -clock clk  -max 1  [get_ports {b[2]}]
set_input_delay -clock clk  -max 1  [get_ports {b[1]}]
set_input_delay -clock clk  -max 1  [get_ports {b[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports valid]
set_output_delay -clock clk  -min 0.5  [get_ports {Vout[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {Vout[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {Vout[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {Vout[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {Vout[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {Vout[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {Vout[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {Vout[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {Vout[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {Vout[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {Vout[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {Vout[0]}]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports rst_n]
set_drive 1  [get_ports {a[7]}]
set_drive 1  [get_ports {a[6]}]
set_drive 1  [get_ports {a[5]}]
set_drive 1  [get_ports {a[4]}]
set_drive 1  [get_ports {a[3]}]
set_drive 1  [get_ports {a[2]}]
set_drive 1  [get_ports {a[1]}]
set_drive 1  [get_ports {a[0]}]
set_drive 1  [get_ports {b[7]}]
set_drive 1  [get_ports {b[6]}]
set_drive 1  [get_ports {b[5]}]
set_drive 1  [get_ports {b[4]}]
set_drive 1  [get_ports {b[3]}]
set_drive 1  [get_ports {b[2]}]
set_drive 1  [get_ports {b[1]}]
set_drive 1  [get_ports {b[0]}]
